[
	{
		"id": "a1329a1b-fed1-4db2-bd3b-864ba2378091",
		"projectName": "Cavaliers Village Homeowner Association System",
		"description": "A web-based community management platform designed to enhance transparency, and operational efficiency within residential villages. It provides administrators, homeowners, and residents with an all-in-one system to manage housing information, community activities, and resident engagement.",
		"image": "/cvhai/01.png",
		"images": [
			"/cvhai/01.png",
			"/cvhai/02.png",
			"/cvhai/03.png",
			"/cvhai/04.png",
			"/cvhai/05.png",
			"/cvhai/06.png",
			"/cvhai/07.png",
			"/cvhai/08.png",
			"/cvhai/09.png",
			"/cvhai/10.png"
		],
		"techUsed": [
			{
				"name": "HTML"
			},
			{
				"name": "CSS"
			},
      {
				"name": "Bootstrap"
			},
			{
				"name": "Javascript"
			},
			{
				"name": "JQuery"
			},
			{
				"name": "Django"
			},
			{
				"name": "Django REST Framework"
			},
			{
				"name": "PostgreSQL"
			}
		],
		"experience": "I worked as a backend developer, with some frontend involvement to integrate the required data via REST APIs. I really enjoyed developing this website with my team, collaborating closely with the frontend developers, project manager and QA Analyst, and integrating the frontend and backend using REST APIs and simple AJAX syntax."
	},
	{
		"id": "39b7e47c-87d7-49dd-b585-2272979af6a4",
		"projectName": "BHNHS Human Resource System",
		"description": "Batasan Hills National Highschool Human Resource System is web-based system designed for managing school personnel, featuring Employee Management, Personal Data Sheet printing for faculty, Leave Management, Attendance Management, and Role-Based Authorization and Authentication using JWT for secure integration with related systems such as the Student Information System (SIS) and Logistics System.",
		"image": "/bhnhs/01.png",
		"images": [
			"/bhnhs/01.png",
			"/bhnhs/02.png",
			"/bhnhs/03.png",
			"/bhnhs/04.png",
			"/bhnhs/05.png",
			"/bhnhs/06.png",
			"/bhnhs/07.png",
			"/bhnhs/08.png",
			"/bhnhs/09.png",
			"/bhnhs/10.png",
			"/bhnhs/11.png"
		],
    "techUsed": [

      {
        "name": "ReactJS"
      },
			{
        "name": "Javascript"
			},
      {
        "name": "InertiaJS"
      },
			{
        "name": "Laravel"
			},
      {
        "name": "HTML"
      },
      {
        "name": "CSS"
      },
      {
        "name": "TailwindCSS"
			},
			{
				"name": "PostgreSQL"
			}
		],
    "experience": "One of the most enriching projects I’ve worked on, this website served as our capstone thesis. Developing this project strengthened my full-stack development skills and experience working with REST APIs, while enhancing my communication abilities as The system was designed to authorize and authenticate users via JWT and to integrate with other closely related systems."
	},
	{
		"id": "10a4cd39-ed3c-452d-a463-f8af7811b59a",
		"projectName": "TherYgros",
		"description": "TherYgros is a Flutter-based IoT application integrated with an ESP-32 microcontroller that measures humidity and precipitation, stores real-time sensor data in Firebase, implements account-based authentication, and provisions WiFi credentials for persistent device connectivity.",
		"image": "/thery/01.png",
		"images": [
      "/thery/01.png",
			"/thery/02.png",
			"/thery/03.png",
			"/thery/04.png",
			"/thery/05.png",
			"/thery/06.png"
		],
    "techUsed": [

      {
        "name": "Flutter"
      },
			{
        "name": "Dart"
			},
      {
        "name": "Firebase"
      },
			{
        "name": "C++"
			},
      {
        "name": "Arduino"
      },
      {
        "name": "ESP-32"
      }
    ],
    "experience": "A simple side project I worked on for my Emerging Technologies course. I integrated an ESP-32 chip and made it communicate with the app via UDP to allow network provisioning and send WiFi credentials to the ESP-32."
	}
]